ams/src/DataProcessors/ДатаМобайл_АРМДиспетчера/ДатаМобайл_АРМДиспетчера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДатаМобайл_АРМДиспетчера</name>
</mdclass:DataProcessor>

ams/src/Documents/ДатаМобайл_УпаковочныйЛист/ДатаМобайл_УпаковочныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДатаМобайл_УпаковочныйЛист</name>
  <attributes>
    <name>IDSSCC</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>48</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕГАИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументТСД</name>
    <type>
      <types>CatalogRef.ДатаМобайл_ДокументыТСД_ЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.ДатаМобайл_ДокументыТСД</types>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <comment>1-короб 2-палет</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТиповойУпаковочныйЛист</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ТСД</name>
    <type>
      <types>ExchangePlanRef.ДатаМобайл_СписокТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМестУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>DataMatrix</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕГАИС_Номенклатура</name>
      <type>
        <types>CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Короб</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Марка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>68</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Палета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СправкаБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/DataProcessors/ДатаМобайл_АРМДиспетчера/Forms/ФормаАктФиксацииЕГАИС/Module.bsl
&НаКлиенте
Процедура ПанельДокументовВыборДобавить(Кнопка)
		
	ПараметрыПодбора=Новый Структура;
	ПараметрыПодбора.Вставить("МножественныйВыбор", Истина);
	Подбор=Получитьформу("Документ.ДатаМобайл_УпаковочныйЛист.ФормаВыбора",ПараметрыПодбора,ЭтаФорма);
	Подбор.ЗакрыватьПривыборе=Ложь;
	Подбор.МножественныйВыбор=Истина;
	Подбор.ОткрытьМодально();	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	Найти= ТаблицаДокументов.Найти(ВыбранноеЗначение.ТекущийЭлемент.ТекущаяСтрока,"Документ");
	Если Найти<>Неопределено тогда	
		Предупреждение("Документ "+ВыбранноеЗначение.ТекущийЭлемент.ТекущаяСтрока+" уже был добавлен в список.");
	ИначеЕсли
		ВыбранноеЗначение.ТекущийЭлемент.ТекущаяСтрока.Тип<>1 тогда
		Предупреждение("Документ "+ВыбранноеЗначение.ТекущийЭлемент.ТекущаяСтрока+" не является документом формирования коробов");
	Иначе	
		СтрокаТЧ = ТаблицаДокументов.Добавить();
		СтрокаТЧ.Документ = ВыбранноеЗначение.ТекущийЭлемент.ТекущаяСтрока;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиДанные(Команда)
	
	ПеренестиДанныеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиДанныеНаСервере()
	
	АктФиксацииОбъект=АктФиксации.ПолучитьОбъект();
	
	n= ТаблицаДокументов.Количество()-1;
	Для i=0 по n цикл
		ТекСтрока=ТаблицаДокументов.Получить(i);
		//Если  ТекСтрока.Документ.Тип<>1 или ТекСтрока.Документ.Тип<>3 тогда //добавляем только короба
		//	продолжить;
		//КонецЕсли;
		
		Для каждого СтрТЧ из ТекСтрока.Документ.Товары цикл
			Если  НЕ (СтрДлина(СтрТЧ.Марка)=68 или СтрДлина(СтрТЧ.Марка)=150) ИЛИ СтрТЧ.Марка=""  тогда //добавляем только корректные данные
				продолжить;
			КонецЕсли;
			
			ДанныеПоСправкам = ДатаМобайл_ОбщийМодуль.ПолучитьСправкиПоСерии(СтрТЧ.Серия);
			
			//Товары
			СтрокиПоиска = АктФиксацииОбъект.Товары.НайтиСтроки(Новый Структура("АлкогольнаяПродукция,СправкаА,СправкаБ",СтрТЧ.ЕГАИС_Номенклатура,ДанныеПоСправкам.СправкаА,ДанныеПоСправкам.СправкаБ));
			Если СтрокиПоиска.Количество()=0 тогда  //нет строк добавляем		
				СтрокаТабличнойЧасти=АктФиксацииОбъект.Товары.Добавить();
				СтрокаТабличнойЧасти.АлкогольнаяПродукция=СтрТЧ.ЕГАИС_Номенклатура;
				СтрокаТабличнойЧасти.СправкаА = ДанныеПоСправкам.СправкаА;
				СтрокаТабличнойЧасти.СправкаБ = ДанныеПоСправкам.СправкаБ;
			Иначе  //есть строка				
				СтрокаТабличнойЧасти = СтрокиПоиска[0];
			КонецЕсли;	
			Если НЕ (ЗначениеЗаполнено(СтрокаТабличнойЧасти.КлючСвязи)) Тогда
				СтрокаТабличнойЧасти.КлючСвязи = ПолучитьНовыйКлючСтроки(АктФиксацииОбъект.Товары);
			КонецЕсли;

			
			//Марки
			СтрокиПоискаМарок=АктФиксацииОбъект.АкцизныеМарки.НайтиСтроки(Новый Структура("КодАкцизнойМарки",СтрТЧ.Марка));
			Если СтрокиПоискаМарок.Количество()=0 тогда
				СтрокаМарки = АктФиксацииОбъект.АкцизныеМарки.Добавить();
				//нетиповое поле
				Попытка СтрокаМарки.НомерКоробки = СтрТЧ.Короб; Исключение КонецПопытки;
				//нетиповое поле
				СтрокаМарки.КодАкцизнойМарки = СтрТЧ.Марка;
				СтрокаМарки.КлючСвязи = СтрокаТабличнойЧасти.КлючСвязи;	
			Иначе
				СтрокаМарки=СтрокиПоискаМарок[0];
			КонецЕсли;
		КонецЦикла;
		
		УпакЛистОбъект=ТекСтрока.Документ.ПолучитьОбъект();
		УпакЛистОбъект.Основание = АктФиксацииОбъект.Ссылка;
		УпакЛистОбъект.Записать(); 
		
	КонецЦикла;

	АктФиксацииОбъект.Записать();
	
	ТаблицаДокументов.Очистить();
	Сообщить("Данные перенесены в ЕГАИС документ"); 
КонецПроцедуры


&НаСервере
Функция ПолучитьНовыйКлючСтроки(ТЧ)
	СвободныйКлюч=0;
	Для Каждого СтрокаТаблицы Из ТЧ Цикл
		СвободныйКлюч=макс(СтрокаТаблицы.КлючСвязи,СвободныйКлюч);
	КонецЦикла;
	СвободныйКлюч=СвободныйКлюч+1;
	
	Возврат СвободныйКлюч;
КонецФункции
